000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ВерсияКомпоненты</name>
    <comment>Версия компоненты</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодЧтенияКарты</name>
    <type>
      <types>EnumRef.МетодЧтенияКартыТерминалом</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВиртуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоОтключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
    <comment>ECROffline</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ОбработчикиДрайверовПодключаемогоОборудования/ОбработчикиДрайверовПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбработчикиДрайверовПодключаемогоОборудования</name>
  <enumValues>
    <name>Обработчик1ССканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1ССчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>Обработчик1СФискальныйРегистраторЭмулятор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикACOMВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикDeviceManagerФискальныйРегистратор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикIngenicoECRCommXПриватбанк</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикResonanceФискальныйРегистратор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикScaleCASВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАртСофтФискальныйРегистратор</name>
    <comment>ФискальныйРегистратор</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолСчитывателиМагнитныхКарт</name>
    <comment>СчитывательМагнитныхКарт</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикАтолЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикККСДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикКлеверенсТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикРайфайзенБанк</name>
    <comment>ЭквайринговыйТерминал</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодСканерыШтрихкода</name>
    <comment>СканерШтрихкода</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканкодТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикСканситиТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМВесыСПечатьюЭтикеток</name>
    <comment>ВесыСПечатьюЭтикеток</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМДисплеиПокупателя</name>
    <comment>ДисплейПокупателя</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМТерминалыСбораДанных</name>
    <comment>ТерминалСбораДанных</comment>
  </enumValues>
  <enumValues>
    <name>ОбработчикШтрихМЭлектронныеВесы</name>
    <comment>ЭлектронныеВесы</comment>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ПодключаемоеОборудование/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	// Загрузка и установка списка доступных обработок
	СписокДрайверов = ПолучитьСписокДрайверов(Объект.ТипОборудования);
	Элементы.ОбработчикДрайвера.СписокВыбора.Очистить();
	Для каждого СтрокаСписка Из СписокДрайверов Цикл
		Элементы.ОбработчикДрайвера.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
	КонецЦикла;

	//Перечисление стандартных типов
	Для каждого ИмяПеречисления Из Метаданные.Перечисления.ТипыПодключаемогоОборудования.ЗначенияПеречисления Цикл
		СоответствиеТиповОборудования.Добавить(ИмяПеречисления.Синоним, ИмяПеречисления.Комментарий);
	КонецЦикла;

	// Защита от изменения типа устройства если тип явно задан или экземпляр уже создан
	Элементы.ТипОборудования.ТолькоПросмотр = (Объект.Ссылка <> Справочники.ПодключаемоеОборудование.ПустаяСсылка());

	// Защита от изменения обработчика драйвера уже созданного экземпляра устройства
	Элементы.ОбработчикДрайвера.ТолькоПросмотр = (Объект.Ссылка <> Справочники.ПодключаемоеОборудование.ПустаяСсылка());
	
	Элементы.ФормаНастроить.Доступность = ЗначениеЗаполнено(Объект.Ссылка); 
	
	Если Объект.УстройствоИспользуется = Объект.УстройствоОтключено Тогда
		Объект.УстройствоИспользуется = НЕ Объект.УстройствоОтключено;
		Модифицированность = Ложь;
	КонецЕсли;
	
	// Доступ к узлу есть только для соответствующего оборудования
	Если Объект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККМOffline
		ИЛИ Объект.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
		Элементы.ПравилоОбмена.Видимость = Истина;
		ПараметрыВыбораПравилаОбмена = ПроцедурыОбменаДаннымиOfflineПереопределяемый.ПолучитьПараметрыВыбораПравилаОбмена(Объект);
		Если ЗначениеЗаполнено(ПараметрыВыбораПравилаОбмена) Тогда
			Элементы.ПравилоОбмена.ПараметрыВыбора = ПараметрыВыбораПравилаОбмена;
		КонецЕсли;
	Иначе
		Элементы.ПравилоОбмена.Видимость = Ложь;
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	Элементы.ФормаНастроить.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.МетодЧтенияКарты.Видимость = (Объект.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикIngenicoECRCommXПриватбанк);
	
КонецПроцедуры

&НаКлиенте	//	LNK 01.08.2019 09:40:27
Процедура ПриОткрытии(Отказ)

	УстановитьВидимостьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Не Отказ
	   И Модифицированность Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте	//	LNK 01.08.2019 09:41:39
Процедура УстановитьВидимостьДоступностьЭлементов()

	Элементы.РежимВиртуальный.Видимость   = (Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал"));
	Элементы.РежимВиртуальный.Доступность = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();

КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Объект.ТипОборудования <> ВыбранноеЗначение Тогда
		Объект.ТипОборудования = ВыбранноеЗначение;
		Модифицированность = Истина;

		// Загрузка и установка списка доступных обработок
		СписокДрайверов = ПолучитьСписокДрайверов(Объект.ТипОборудования);
		Элементы.ОбработчикДрайвера.СписокВыбора.Очистить();
		Для каждого СтрокаСписка Из СписокДрайверов Цикл
			Элементы.ОбработчикДрайвера.СписокВыбора.Добавить(СтрокаСписка.Значение, СтрокаСписка.Представление);
		КонецЦикла;
		
		Объект.ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ПустаяСсылка");
		
		// Доступ к узлу есть только для соответствующего оборудования
		Элементы.ПравилоОбмена.Видимость = Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ККМOffline")
			ИЛИ Объект.ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток");

	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	УстановитьВидимостьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ИмяОбработчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ВыбранноеЗначение <> Объект.ОбработчикДрайвера Тогда

		ОбработатьВыборОбработчика(ВыбранноеЗначение, СтандартнаяОбработка);
		Элементы.МетодЧтенияКарты.Видимость = (Объект.ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикIngenicoECRCommXПриватбанк"));

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьВыборОбработчика(ВыбранныйОбработчик, СтандартнаяОбработка = Истина)

	Объект.Наименование = "'" + Строка(ВыбранныйОбработчик) + "'"
						+ ?(ПустаяСтрока(Строка(Объект.РабочееМесто)),
							"",
							" " + НСтр("ru='на'") + " " + Строка(Объект.РабочееМесто));

КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)

	Если НЕ МенеджерОборудованияКлиент.ДрайверУстановлен(Объект.Ссылка) Тогда

		Результат = Вопрос(НСтр("ru = 'Установить драйвер?'"), РежимДиалогаВопрос.ДаНет);

	ИначеЕсли Объект.ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СФискальныйРегистраторЭмулятор") Тогда

		Результат = Вопрос(НСтр("ru = 'Обновить установленный эмулятор?'"), РежимДиалогаВопрос.ДаНет);	//	LNK 01.08.2019 09:40:12

	Иначе

		Результат = КодВозвратаДиалога.Нет;

	КонецЕсли;

	Если Результат = КодВозвратаДиалога.Да Тогда

		МенеджерОборудованияКлиент.УстановитьДрайвер(Объект.Ссылка);

	КонецЕсли;

	ОчиститьСообщения();
	СообщениеОбОшибке = "";
	НастройкиИзменены = Ложь;
	
	Записать();
	
	Результат = МенеджерОборудованияКлиент.ВыполнитьНастройкуОборудования(
	   Объект.Ссылка,
	   НастройкиИзменены,
	   СообщениеОбОшибке);
	   
	Прочитать();
	
	Если Результат И НастройкиИзменены Тогда
		// Настройки были изменены
		ОбновитьПовторноИспользуемыеЗначения();
	ИначеЕсли Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;


КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокДрайверов(ТипОборудования)

	СписокДрайверов = Новый СписокЗначений();
	Для каждого ИмяПеречисления Из Метаданные.Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ЗначенияПеречисления Цикл
		Если ТипОборудования = ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования." + ИмяПеречисления.Комментарий)
		 Или ИмяПеречисления.Комментарий = "" Тогда
			СписокДрайверов.Добавить(ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования." + ИмяПеречисления.Имя));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокДрайверов;

КонецФункции
	
#КонецОбласти
